{"data":{"markdownRemark":{"html":"<p><em>First</em>: Reading a book requires so much of my attention that I never finish books that do not interest me. Therefore, I would recommend all the books listed below. <br><br>\nThis list will be updated continuously.</p>\n<h2><u> this year </u></h2>\n<ul>\n<li>\n<p><b>Asymmetry</b> - <em>05/02/19</em><br>\nThe structure of this book is a bit of a puzzle. The first, second and third all act tie together in a subtle way. I like the book because of the content, not the puzzle. Intricate and enjoyed.\n<br><br></p>\n</li>\n<li>\n<p><b>Still Me</b> - <em>23/01/19</em><br>\nI didn't realize this book was part of a trilogy until I finished it which I guess is a good thing. It’s a story that focuses around life and growing up and relationships and New York City. I really enjoyed it. A great ending too.\n<br><br></p>\n</li>\n<li>\n<p><b>Priestdaddy</b><br>\nI read this one last year but never wrote about it. This book is hilarious. Focuses on the struggles of masculinity, church, religion, family. Manages to find humour in every one of those topics. I really liked it.\n<a href=\"/_pages/highlights/Priestdaddy\">Highlights here</a>\n<br><br></p>\n</li>\n<li>\n<p><b>Shoe Dog</b>- <em>07/01/19</em><br>\nThis book motivates yet discourages entrepreneurship for me. The thrill of working towards a vision you create, changing customers’ lives, the idea of having a legacy, are all overwhelmingly desireable. And since Phil seems like the most humble of founding billionaires, the ups and downs of his story are described pretty objectively. But his storytelling leads to many reflections on what he is sacrificing to achieve those goals. And I empathized with those parts more. Knight’s journey makes for a thrilling story either way.<br>\n<br></p>\n</li>\n</ul>\n<h2><u> 2018 </u></h2>\n<ul>\n<li>\n<p><b>Leviathan Wakes</b><br>\nI haven’t read any new science-fiction in a while. This book grabbed me. It’s gritty, intricate, emotional and never dull. Will probably keep reading this series. Not sure why I haven’t been reading more science-fiction.\n<br><br></p>\n</li>\n<li>\n<p><b>Bad Blood</b><br>\nRead this one quickly. This is the story behind the rise and fall of Theranos. If that company is unknown to you, I highly recommend looking them up. The story is larger than life and illustrates the strange motivations that govern Silicon Valley. It’s disturbing how much they got away with and for how long. It made me question the whole ecosystem. They’ll probably make a movie about it soon.<br>\n“…in her [Elizabeth Holmes’s]  all-consuming quest to be the second coming of Steve Jobs amid the gold rush of the “unicorn” boom, there came a point when she stopped listening to sound advice and began to cut corners. Her ambition was voracious and it brooked no interference.”\n<br><br></p>\n</li>\n<li>\n<p><b>Circe</b><br>\nI love the Greek Gods. Their combination of vanity and absolute power always makes for exciting stories. This book went by quickly. It’s a retelling of <em>The Odyssey</em> and several other classic Greek tales from the perspective of the Goddess Circe. Reading it felt somewhat similar to Percy Jackson but I wouldn’t recommend it to children. It explores the idea of immortality, love, children, beauty. There is a happy ending.<br>\n“he had never met a god [Circe] who enjoyed their divinity less.”\n<br><br></p>\n</li>\n<li>\n<p><b>Naked Economics</b><br>\nI haven't finished this book yet. Mostly because it has a tendency to put me to sleep which is convenient since I read it right before bed. Despite that, I enjoy every second I'm awake! Hopefully it will be done by Christmas. (Update: Just finished it)<br>\n<a href=\"/_pages/highlights/Naked-Economics\">Highlights here</a>\n<br><br></p>\n</li>\n<li>\n<p><b>Orchid and the Wasp</b><br>\nThis book reminds me of The Goldfinch. Despite the unusual situations Gael (the protagonist) finds herself in, I <em>believe</em> in the logic of why she got there. In fact, I feel like that's where I would be in her shoes despite her facetious, ruthless, manipulative personality. Yet at her core, Gael is motivated by her caring for her family. I guess the ends justify the means.\n<a href=\"/_pages/highlights/Orchid-and-the-Wasp\">Highlights here</a>\n<br><br></p>\n</li>\n<li>\n<p><b>The Looming Tower</b><br>\nThis is the first non-fiction book that has kept me engaged for over a month of regular reading. The book explores Islam, US Policy, personal motivations; and culminates in 9/11. Despite this inevitable conclusion, what kept me reading is the background leading up to the event and not the event itself. My knowledge surrounding the events leading up to 9/11 involving Bin Laden, Sudan, Yemen and Saudi Arabia was murky and misinformed until I started reading this book.\n<br><br></p>\n</li>\n<li>\n<p><b>The English Patient</b><br>\nNot sure how I got through this book. It has exciting moments, but they are few and far between. This book takes a certain type of focus and patience that I barely have. It’s rewarding by the end though. About a group of people who live in an Italian villa after the War. Explores each of their histories, some more than others.\n<br><br></p>\n</li>\n<li>\n<p><b>The Brief and Wondrous Life of Oscar Wao</b><br>\nFun book to read. It goes by fast mostly due to the narrator’s hilarious tone. Follows a family through three generations as they navigate the Dominican Republic and then the United States, but mostly about Oscar Wao. Left me with a melancholy feeling. Important tip: Do not read the introduction, it takes way too long and is discouraging.\n<br><br></p>\n</li>\n<li>\n<p><b>The Idiot</b><br>\nThis book is dense. It took me a while to finish. I haven't encountered this type of writing style before. It's abrupt and unique. I identify with the main character and her setting deeply. <a href=\"/_pages/highlights/The-Idiot\">Highlights here</a>.\n<br><br></p>\n</li>\n<li>\n<p><b>La Belle Sauvage</b><br>\nI had a vague memory of liking the <em>Golden Compass</em> trilogy by the same author (Philip Pullman), which is why I read this book. It took me by surprise. The shift of environment and tone after the first half was sudden, but grew on me. One of my favourite main characters in any book. This story carries with it some deeper moral lessons. Set in a similar world as Harry Potter, but more serious and <em>slightly</em> less supernatural.\n<br><br></p>\n</li>\n<li>\n<p><b><a href=\"/2018/05/on-statistics.html\">Naked Statistics</a></b><br>\nUntil reading this book, I never had a grasp on statistics. I’ve now realized how important it is. The nature of statistics is counter-intuitive and learning the a few important concepts means defeating misinformation in your daily life. It’s dense though.\n<br><br></p>\n</li>\n<li>\n<p><b>The Obelisk Gate</b><br>\nThe second book in the Broken Earth series. Just as engaging as the first. Sped through this book in two days.\n<br><br></p>\n</li>\n<li>\n<p><b>The Fifth Season</b><br>\nI devoured this book. The first in the Broken Earth series. Starts out rough, but keeps you trapped till the end. The first time in a while I’ve actually been enthralled with fantasy.\n<br><br></p>\n</li>\n<li>\n<p><b>Death’s End</b><br>\nA fitting end to an amazing trilogy. This book dives even deeper into fantasy and I believe it completely every step of the way. Contains the most realistic view of our (humanity’s) future, I think.\n<br><br></p>\n</li>\n<li>\n<p><b>The Dark Forest</b><br>\nThe book is better than the first (The Three-Body Problem) in the trilogy. Takes a while to get started, but it’s an amazing ride once it does. If you are at all interested in alien life or astrophysics please read this book.<br>\nThe idea of a “dark forest” is so overarching and terrifying that it my changed my perception of space.<br>\n<br></p>\n</li>\n<li>\n<p><b>The Three-Body Problem</b> (re-read)<br>\nMy second favorite science-fiction novel. Involves the Chinese Cultural Revolution, chaotic motion, aliens and a funny cop. Mostly, it keeps engaging you with an overarching mystery. The novel gives you a jarring view of what contact with extra-terrestrial intelligence would feel like.\n<br><br></p>\n</li>\n<li>\n<p><b>Annihilation</b><br>\nUnnerving and disturbing. This book is a fictional story that reads like a non-fiction account of reality. Like a black mirror episode in a novel. It’s a quick read too.\n<br><br></p>\n</li>\n<li>\n<p><b>Red Sparrow</b><br>\nA thriller that delves into Russian culture but mostly keeps you reading it at all costs. A combination of James Patterson and John Le Carré. More Patterson than Le Carré though. Also, recipes are provided at the end of every chapter.\n<br><br></p>\n</li>\n<li>\n<p><b>A Brave New World</b><br>\nA terrifying view on our dystopian future. Even more striking when considered with technologies like CRISPR and stem cells. Asks many questions about human nature.\n<br><br></p>\n</li>\n<li>\n<p><b>Pachinko</b><br>\nA book that navigates through three generations of Korean immigrants in Japan during the Second World War. The story struck a chord with me since I come from a family of immigrants. Vividly illustrates the sacrifices that the older generation makes. Really liked this one.\n<br><br></p>\n</li>\n<li>\n<p><b>A Gentleman in Moscow</b><br>\nSet in the Soviet Union in Moscow in a famous hotel. A former Count lives from middle to old-age and must raise a adopted child within the walls of the hotel. He makes the best of his experience and we see him deal with the existing and developing culture of Russia. A happy ending.\n<br><br></p>\n</li>\n<li>\n<p><b><a href=\"/2017/12/Age-of-Ambition.html\">Age of Ambition: Chasing Fortune, Truth, and Faith in the New China</a></b><br>\nA useful and striking introduction to modern day China. Illustrates the speed at which China is growing and the costs of that growth. It is long.\n<br><br></p>\n</li>\n</ul>\n<h2><u> 2017 </u></h2>\n<ul>\n<li>\n<p><b>Fooled by Randomness</b><br>\nThis book was the catalyst for my obsession with Behavioural Economics. Nassim Nicholas Taleb effectively eliminated my trust in the global stock market and everyone who works for it. I do not, however, align with his political beliefs. Taleb lays out how we all operate under frightening amounts of randomness. Highly recommend.\n<br><br></p>\n</li>\n<li>\n<p><b>Thanks, Obama</b><br>\nBeing deeply immersed in US political news has made working in the White House have a magical allure. This book grounded some of my dreams in reality, but also elevated many more. Being surrounded by capable, hopeful idealists who shape the future of the world everyday will never get old.<br><br></p>\n</li>\n<li>\n<p><b>The Rosie Project</b><br>\nI started this book because Bill Gates recommended it. The whole book doesn’t seem grounded in reality, but that doesn’t make it less interesting. It speaks to how people meet each other and what influences us to start or end relationships.\n<br><br></p>\n</li>\n<li>\n<p><b>The Three-Body Problem</b><br>\nSee above.\n<br><br></p>\n</li>\n<li>\n<p><b>A Visit from the Goon Squad</b> (twice its very good)<br>\nI love this book. Describes the intertwining lives of Bennie and Sasha. The story feels melancholy the whole way through, but there are enough happy moments to pull you through.\n<br><br></p>\n</li>\n<li>\n<p><b>A Horse Walks Into a Bar</b><br>\nA dark comedy? Takes place during one evening at a comedy club. I feel like I learned something about performance by reading this book. Also hilarious at times.\n<br><br></p>\n</li>\n<li>\n<p><b>The Undoing Project</b><br>\nA <em>dense</em> book. About the inception of Behavioural Economics. Follows the relationship of two academics.\n<br><br></p>\n</li>\n<li>\n<p><b>American Kingpin</b><br>\nAbout the founder of the dark web. Draws some pretty blurry moral lines about why the main character is guilty. Recommended by Casey Neistat.\n<br><br></p>\n</li>\n<li>\n<p><b>Seveneves</b> (almost)<br>\nBill Gates said he loved this book so I decided to read it. I was about three-quarters of the way through before the whole plot started getting predicable and too disheartening to follow. Interesting concept though.\n<br><br></p>\n</li>\n<li>\n<p><b>So You’ve Been Publicly Shamed</b><br>\nThis book is SOOO relevant today. Describes what it feels like to be on the other side of internet outrage. How a mob mentality can lead to terrible consequences.\n<br><br></p>\n</li>\n<li>\n<p><b>Swordspoint</b><br>\nAs I’ve gotten older, my focus has turned away from fantasy and towards science-fiction. This book is an exception.\n<br><br></p>\n</li>\n<li>\n<p><b>The Sisters Brothers</b><br>\nReally good book. A Western with real cowboys and guns. Has a good moral at the end.\n<br><br></p>\n</li>\n<li>\n<p><b>The Psychopath Test</b><br>\nAnother Jon Ronson book (SYBPS). I’ve always been fascinated by psychopaths and this book centres around what defines them as such. Do they run the world’s largest corporations? Does their existence always result in a lot of dead people?\n<br><br></p>\n</li>\n</ul>\n<h2><u> probably before 2017 </u></h2>\n<ul>\n<li>\n<p><b>The Goldfinch</b><br>\nThis might be my <em>favourite book</em>. I fell in love with every single character. About a boy and his journey through life.\n<br><br></p>\n</li>\n<li>\n<p><b>The Buried Giant</b><br>\nThis book stayed with me. One of the most mature fantasy novels I’ve read. The authors tone is never crowded or too detailed, yet the characters are so easy to empathize with.\n<br><br></p>\n</li>\n<li>\n<p><b>The Revenant</b><br>\nBrutal, cunning and savage. Leo Dicaprio and bears. If you liked the movie, you’ll love the book because it’s three times as long.\n<br><br></p>\n</li>\n<li>\n<p><b>The Secret History</b><br>\nBy the same author who wrote <em>the Goldfinch</em> (my favourite book). “The story is an inverted detective story, not a whodunit but a <em>whydunit</em>”. &#x3C;— from Wikipedia\n<br><br></p>\n</li>\n</ul>\n<p><em>I will finish these summaries</em>\n<br><br></p>\n<ul>\n<li>\n<p><b>All The Light We Cannot See</b>  <br></p>\n</li>\n<li>\n<p><b>The Big Short</b>  <br></p>\n</li>\n<li>\n<p><b>Flash Boys</b>  <br></p>\n</li>\n<li>\n<p><b>Boomerang</b>  <br></p>\n</li>\n<li>\n<p><b>The Luminaries</b>  <br></p>\n</li>\n<li>\n<p><b>The Martian</b>  <br></p>\n</li>\n<li>\n<p><b>Gone Girl</b>  <br></p>\n</li>\n<li>\n<p><b>Consider the Lobster</b>  <br></p>\n</li>\n<li>\n<p><b>In the Skin of a Lion</b>  <br></p>\n</li>\n<li>\n<p><b>Game of Thrones</b>  <br></p>\n</li>\n<li>\n<p><b>Bad Monkey</b>  <br></p>\n</li>\n<li>\n<p><b>The Cat’s Table</b>  <br></p>\n</li>\n<li>\n<p><b>Steve Jobs</b>  <br></p>\n</li>\n</ul>","frontmatter":{"title":"My Book List"}}},"pageContext":{"isCreatedByStatefulCreatePages":true}}