{"data":{"site":{"siteMetadata":{"title":"kahvi's blog","author":"Kahvi Patel"}},"markdownRemark":{"id":"140ba5f0-f735-587b-85e5-8309ded1fd08","excerpt":"Background: Malcolm Gladwell hosts a podcast, he did an episode on CTE today. Chronic traumatic encephalopathy (CTE) is the reason everyone is scared of…","html":"<p>Background: Malcolm Gladwell hosts a <a href=\"http://revisionisthistory.com/seasons?selected=season-3\">podcast</a>, he did an episode on CTE today. Chronic traumatic encephalopathy (CTE) is the reason everyone is scared of football these days: Head trauma leads a bunch of bad stuff.</p>\n<p>His thesis, basically, is: “At what point do you have enough proof to act?”</p>\n<p>In a speech given at UPenn in 2013, Gladwell uses the example of coal miners in the 1940s. Coal was an integral part of the economy back then; many working class families were supported by the industry. There were drawbacks though. Namely, workers would cough up black coal dust and generally cough a lot. </p>\n<p>For various reasons, people said the coughing was a sign of the respiratory system working <em>correctly</em> and did not consider negative health impacts.</p>\n<p>Then a statistician came along and <strong>proved</strong> that inhaling coal dust all day was very bad for you and reduces your life expectancy.</p>\n<p>Here, in his speech, Malcolm asks the audience “What do you think happened then?”</p>\n<p>“<em>Nothing</em>” he answers dramatically (it was a rhetorical question).</p>\n<p>It wasn’t until 1975 that a general consensus was reached about the dangers of coal mining and action was taken. </p>\n<p>Gladwell’s parallel is with football today.</p>\n<p>He goes on to argue that the students at UPenn should boycott the school’s football game in protest of the University ignoring proof.</p>\n<h2><strong>I have a problem with his argument though.</strong></h2>\n<p><strong>If an adult is aware of the risks of an activity and is not harming others in the process, what right do we have to stop them?</strong></p>\n<p>This question has little to do with football, yet is the core of Gladwell’s argument. <em>Every sport</em> has different degrees of good and bad depending on who you ask.</p>\n<p>The key insight is that the people participating should be the ones to weigh the pros and cons, not us. </p>\n<p>Society should do everything in its power to provide information to judge the sport with (like studies about CTE), but the <em>decisions made</em> based on that information are <em>not</em> in society’s control.</p>\n<p>This idea of athletes taking this decision into their own hands was never addressed in the podcast. Instead, athletes were only mentioned when the consequences of <em>their</em> actions befell <em>them</em>.</p>\n<p>Malcolm strays away from this moral question, or purposefully ignores it, because it is harder to answer than the one he asks in his podcast.</p>\n<p>Reducing this issue down to right and wrong is reductive and demeans the judgment of football players/responsible adults.</p>\n<p><strong><em>this post is incomplete</em></strong></p>","frontmatter":{"title":"on gladwell","date":"May 28, 2018","description":"an incomplete argument"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2018-05-28-on gladwell/","previous":{"fields":{"slug":"/2018-05-09-on statistics/"},"frontmatter":{"title":"on statistics"}},"next":{"fields":{"slug":"/drafts/X2018-07-21-us ideology/"},"frontmatter":{"title":"us ideology"}}}}