{"data":{"site":{"siteMetadata":{"title":"kahvi's blog","author":"Kahvi Patel"}},"markdownRemark":{"id":"e0d8035d-41b7-54b5-b811-ec5875235189","excerpt":"This one gets into political ideology which I don’t usually like to talk about.\nSpending a few days in and around Chicago has illustrated to me the constant…","html":"<p>This one gets into political ideology which I don’t usually like to talk about.\nSpending a few days in and around Chicago has illustrated to me the constant, uncomfortable tension in American society.</p>\n<p>To begin, Canada is not that different from America. Obviously.</p>\n<p>If money is our objective measure of success, Canada is failing. Our dollar is weaker. Is the mentality behind the US economy the right one? So often it’s painted as an abstract idea of perseverance and determination over everything. Seeing this in effect is less simple.</p>\n<p>We use money as our objective measure of success because that’s what everyone else uses.</p>\n<p>The stress I see around Chicago is not unlike the one that exists in Kingston. There are wealthy areas and not wealth areas. What disturbs me is the scale to which this applies in America. It’s either poor or rich.</p>\n<p>I read this in every headline: The middle class is disappearing. It’s really harsh to see the reality reflect those headlines.</p>\n<p>Everything that’s big is bigger. Everything that’s small is smaller. Everyone that’s rich is richer, everyone that’s poor is poorer.</p>\n<p>(This is me dumming an incredible complex issue down to an easily digestible couple sentences that sound the same to make it easier to convince you of my perspective)</p>\n<p>But the difficulty is that people want it that way. The mentality is all or nothing.</p>\n<p>You wonder why so many people fall into that trap of inflated optimism. I’m a victim to it. I think my future will be brighter than it should be. It’s a country of idealists. With no facts to go around. And their infrastructure is shitty.</p>\n<p>The mentality is confusing. For there to be winners, there have to be losers. Yet the losers think they’re all winners in the making and the winners keep convincing reinforcing that false belief.</p>\n<p><strong><em>this post is incomplete</em></strong></p>","frontmatter":{"title":"us ideology","date":"July 21, 2018","description":"this gets political?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/drafts/X2018-07-21-us ideology/","previous":{"fields":{"slug":"/2018-05-28-on gladwell/"},"frontmatter":{"title":"on gladwell"}},"next":{"fields":{"slug":"/2018-07-21-youtube/"},"frontmatter":{"title":"my youtube channel"}}}}