{"data":{"site":{"siteMetadata":{"title":"kahvi's blog","author":"Kahvi Patel"}},"markdownRemark":{"id":"ce7e7b1e-811e-519c-ac76-ef5aea8c01cf","excerpt":"this post is incompleteSkip to the shortcuts.Disclaimer: I am not expert in this subject, but I’ve done my best to avoid misinformation throughout this post. If…","html":"<p><strong>this post is incomplete</strong></p>\n<p>Skip to the <a href=\"#shortcuts\">shortcuts</a>.</p>\n<p>Disclaimer: I am <em>not</em> expert in this subject, but I’ve done my best to avoid misinformation throughout this post. If I’ve gotten anything wrong, send me an email.</p>\n<p>Recently, I’ve gotten better at interacting with my computer.<br>\nIt’s a mid-2014 MacBook Pro with 8GB of RAM, 128GB of storage; pretty standard. Despite these outdated stats, I don’t want a new computer.\nMy relationship with my laptop has changed. Even though it’s 5 years old, these days it feels like I’m interacting with a new machine. More accurately, I have a <em>new way</em> of interacting with my machine. </p>\n<p>Basically, this post is all about inputs. </p>\n<p>Usually to make your computer do things, you interact with it through a controller. Those controllers are usually a mouse/trackpad and a keyboard.<br>\nFor the majority of my life, the mouse was the way I interacted with a computer. This means what you think it does. Clicking, dragging, selecting, highlighting; everything was done using my hand to move the mouse across the screen. The keyboard was used for typing, turning up the brightness and maybe pausing Youtube videos.\nThis method of interaction is fine. It’s cool. It’s what most people do.</p>\n<p>It isn’t fast though. </p>\n<p>The keyboard is fast. If you are a relatively good typer (like I am), the keyboard will change your life.\nPut simply, <strong>I’m telling you to use more keyboard shortcuts.</strong>\nThe reason I wrote a whole blog post to tell you this is because it really speeds up <em>everything</em> you do.\nI created this blog post, setup a localhost to view it on Chrome and am writing this post <em>all</em> without touching the trackpad.\nThis also implies something important. The less you use the mouse, the less you need a Graphical User Interface (GUI).</p>\n<p>This is how I think of it. Imagine you have a window on your computer screen with a bunch of buttons on it. Like the toolbar in Microsoft Word. Every button on that screen has a specific function: Set the font size, font colour, line spacing, bold, etc. </p>\n<p><img src=\"/assets/word-toolbar.png\" alt=\"Word toolbar\"></p>\n<p>To use these functions, you navigate the mouse to each button. This takes time because you are typing words, then you have to use the mouse, then you have to switch back to using the keyboard. What if you didn’t have to navigate your mouse to anything? What if the keys on your keyboard are the buttons!?\nIn that case, why have the buttons on the screen in the first place? If the buttons are your keys, why do you need buttons on the screen?</p>\n<p>Okay, that was a bit confusing. Let me put this another way.<br>\nImagine you didn’t have a keyboard. Imagine you had to write an essay using a mouse and a virtual keyboard on the screen. </p>\n<p><img src=\"/assets/virtual-keyboard.jpg\" alt=\"virtual keyboard mac\"></p>\n<p>That would suck, right? Clicking every character? It would take so long! Even though clicking one letter on a virtual keyboard takes less than a second, doing it repeatedly adds up.\nThis same idea applies to interacting with your computer as a whole. For <em>most</em> things, the keyboard is faster than the mouse. Individual operations are not faster by hours or minutes or seconds. They’re faster by less than a second. But again, it adds up.\nThis leads to the command line.\nThe command line is an application with exactly this in mind. The keyboard is your <em>only</em> controller. The mouse is useless. Therefore, a GUI is pretty useless too. That’s why you only see characters on the screen and no buttons.</p>\n<p><img src=\"/assets/command-line.png\" alt=\"command line\"></p>\n<p>I’ll come clean though. At first, my motivation to learn how to use the command line was because it looks cool. It looks really cool. Ever seen a hacking scene in a movie where the hacker is moving a mouse to something? No! They’re <strong>typing</strong> gibberish because <strong>typing</strong> gibberish is so much faster than clicking gibberish.</p>\n<p>Also once you get used to it, it’s really fast.</p>\n<p>If you are a developer or are interesting in coding, the command line becomes a big part of your life.\nIf not, the command line doesn’t <em>really</em> matter &#x3C;- (a claim I’m making).\nBUT keyboard shortcuts to navigate your OS do. Since I’m on Mac, this is a list of easy shortcuts I can provide.</p>\n<h2>Shortcuts</h2>\n<pre><code>Legend:  \n⌘ is the Command key  \n⌥ is the Option key  \n⇧ is the Shift key\n  \n“+” means pressing the two keys at the same time\n\nMacOS\n- Switch Apps: ⌘ + Tab\n- Navigate Workspaces: Control + ← or →\n- Search with spotlight: ⌘ + space\n\nApplications \n- New Tab: ⌘ + t\n- Type in Nav Bar: ⌘ + l\n- Navigate Tabs: ⌘ + ⌥ + ← or →\n- Save File: ⌘ + s\n- Close Window: ⌘ + w\n- Undo: ⌘ + z\n- Redo: ⌘ + ⇧ + z\n- Zoom In/Out: ⌘ + + or -\n- Quit App: ⌘ + q\n\nText\n- Select All: ⌘ + a\n- Make Bold: ⌘ + b\n- Make Italic: ⌘ + i\n- Select Words:  ⌥ + ⇧ +  ← or →\n- Navigate Words: ⌥ +  ← or →\n~~~\n</code></pre>","frontmatter":{"title":"shortcuts","date":"November 22, 2018","description":"how I've gotten better at using my computer"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2018-11-22-shortcuts/","previous":{"fields":{"slug":"/2018-09-12-Volunteer Robot/"},"frontmatter":{"title":"Volunteer Robot"}},"next":{"fields":{"slug":"/2019-01-02-2019/"},"frontmatter":{"title":"2019"}}}}